In [ ]:
''' Acceptable range of skewness and kuritosis
1.Fairy Symmertrical : -0.5 <skewness <0.5
2.Moderately skewed : -1 <skewness < 1
3.Highly Skewes : skewness >1
                  skewness <-1
4.Mesokurtic : 2< kurtosis <4 

#HOW TO USE MEASURES ?
1. Symmetrical distribution : Mean
2. Skewed distribution : Meadian
3. Categorical data/Discrete data : Mode

In [2]:
s=[70,50,10,20,60,40,30]
mean=40
std=21.6

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\shiva\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\shiva\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\shiva\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\shiva\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\shiva\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\shiva\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
list=[1,3,5,7,9]
ser=pd.Series(list,index=["1st","2nd","3rd","4th","5th"])
ser

1st    1
2nd    3
3rd    5
4th    7
5th    9
dtype: int64

In [5]:
a_dict={'first':1,'second':2,'third':3,'fourth':4,'fifth':5}
ser=pd.Series(a_dict)
ser

first     1
second    2
third     3
fourth    4
fifth     5
dtype: int64

In [19]:
import pandas as pd
import numpy as np
an_array=np.array([[25,85],[12,49],[14,81],[11,91],[15,92]])
ser=pd.DataFrame(an_array,
                 index=['shi','var','kai','sud','bab'],
                             columns=['id',"marks"])
ser

     id  marks
shi  25     85
var  12     49
kai  14     81
sud  11     91
bab  15     92

In [21]:
ser.values

array([[25, 85],
       [12, 49],
       [14, 81],
       [11, 91],
       [15, 92]])

In [22]:
ser.index

Index(['shi', 'var', 'kai', 'sud', 'bab'], dtype='object')

In [23]:
dict1={'name':{'shi':'shiva','var':'vardhan','kai':'kailash','sud':'sudheer','bob':'babu'},
        'age':{'shi':21,'var':20,'kai':19,'sud':20,'bob':20},
        'marks':{'shi':91,'var':86,'kai':87,'sud':21,'bob':92}
              }
df=pd.DataFrame(dict1)
df

        name  age  marks
shi    shiva   21     91
var  vardhan   20     86
kai  kailash   19     87
sud  sudheer   20     21
bob     babu   20     92

In [24]:
df.columns

Index(['name', 'age', 'marks'], dtype='object')

In [25]:
df.index

Index(['shi', 'var', 'kai', 'sud', 'bob'], dtype='object')

In [26]:
type(df.values)

numpy.ndarray

In [28]:
df.values.shape

(5, 3)

In [31]:
import pandas as pd
ser1 = pd.Series(['Shiva','vardhan','kailash','sudheer','babu'],index=['shi','var','kai','sud','bob'])
ser2 = pd.Series([25,25,26,24,23],index=['shi','var','kai','sud','bob'])
ser3 = pd.Series([85,90,70,80,91], index=['shi','var','kai','sud','bob'])
a_dict1={'name':ser1,
        'age':ser2,
        'marks':ser3
       }
df=pd.DataFrame(a_dict1)
df

        name  age  marks
shi    Shiva   25     85
var  vardhan   25     90
kai  kailash   26     70
sud  sudheer   24     80
bob     babu   23     91